app/controllers/cars_controller.rb

SELECT "cars".* FROM "cars"
SELECT "bookings".* FROM "bookings" WHERE "bookings"."user_id" = ? AND ("bookings"."status" != ?)  [["user_id", 1], ["status", 3]]
SELECT "bookings".* FROM "bookings" WHERE (car_id = 6 AND pickup_time <= '2022-06-02 08:09:16' AND return_time >=  '2022-06-02 08:09:16')
---
  def index
    @search = Car.search(params[:q])
    @cars = @search.result
    if (current_user.try(:user?))
      @booking = Booking.where(:user_id => current_user.id).where.not(status: 3).to_a()
    else
      @booking = []
    end

    if @booking.length <= 0 then